import re

def valid_passport_number(text: str) -> bool:
    pattern = r'''(?:ЕС|АР|АА|АВ|АТ|АС|АЮ|АЕ|АК|АМ|АО|АН|ВА
    |ВВ|ВЕ|ВН|ВС|ВТ|СЕ|СС|ВО|СА|СВ|СЮ|СТ|МЕ|СИ|СН|СО|ТТ
    |МЕ|СК|СМ|СТ|ЕА|ЕВ|ЕК|ЕМ|ЕН|КА|КВ|КС|ЕО|ЕР|КЕ|КК|КМ|КН
    |СР|МЮ|МА|МС|КС|МК|МН|МО|НА|НЕ|НС|НК|КР)[1-9][0-9]{5}'''
    return re.fullmatch(pattern, text) is not None

def valid_inn(text:str)->bool :
    pattern = r'[1-9][0-9]{9}'
    return re.fullmatch(pattern, text) is not None
    # Десята цифра — контрольна. Алгоритм для її розрахунку такий[12] (вважатимемо, що код має вигляд АБВГҐДЕЄЖЗ):
    # Розраховуємо контрольну суму Х = А*(-1) + Б*5 + В*7 + Г*9 + Ґ*4 + Д*6 + Е*10 + Є*5 + Ж*7
    # Остача від ділення контрольної суми на одинадцять буде контрольним числом: Кч = Х - (11 * ціла частина від (Х/11)) (для Microsoft Excel виглядає наступним чином =X-ROUND(X/11; 0)*11) або =ОСТАТ(X;11), для англомовних версій та OpenOffice/LibreOffice Calc =MOD(X;11)).
    # Контрольне число може мати значення від нуля до десяти. У разі залишку 10 старша одиниця відкидається. Контрольною цифрою буде остання цифра контрольного числа (тобто, контрольне число за модулем 10):
    # З = (Х%11)%10 або З = MOD(MOD(X;11);10).


def valid_car_number(text: str)->bool:
    # Дніпропетровська: РР, МI   # Харкiвcька ХХ, ЕХ 
    pattern = r'(РР|МI|ХХ|ЕХ)[0-9]{4}[А-ЩЬЮЯЇІЄҐ]{2}'
    return re.fullmatch(pattern, text) is not None


def main():
    print('Паспорт КР445222 существует? ', valid_passport_number('КР445222'))
    print('Инн: 5102100586 существует? ', valid_inn('5102100586'))
    print('Авто из Харькова ХХ0483АЄ существует?', valid_car_number('ХХ0483АЄ'))


if __name__=='__main__':
    main()
